app/Controllers/Home.php

    public function index()
    {
        echo view('inc/header');
        $data['users'] =     $this->user->orderby('id','DESC')->paginate(3,'group1');
---
SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `users`